nanoframework/nf-interpreter/targets/ESP32/_common/targetHAL_ConfigurationManager.cpp
//
// Copyright (c) .NET Foundation and Contributors
// See LICENSE file in the project root for full license information.
//

#include <nanoHAL.h>
#include <nanoHAL_v2.h>
#include <nanoWeak.h>
#include "esp32_idf.h"
#include <targetHAL_ConfigStorage.h>
#include <target_platform.h>
#include "esp_mac.h"

bool ethernetEnabled = false;

// NVS parameters for Interface config
#define NVS_NAMESPACE "nanoF"

// #define DEBUG_CONFIG        1

#ifdef DEBUG_CONFIG
void PrintBlock(char *pBlock, int bsize)
{
    char *pCurrStart;
    char *pCurrPos;
    char *pCurrEnd;
    char *pCurrEndBlock = pBlock + bsize;

    pCurrStart = pBlock;

    while (pCurrStart <= pCurrEndBlock)
    {
        pCurrPos = pCurrStart;
        pCurrEnd = pCurrStart + 32;

        while (pCurrPos < pCurrEnd && pCurrPos <= pCurrEndBlock)
        {
            ets_printf("%02X ", *pCurrPos);
            pCurrPos++;
        }

        ets_printf(" ");

        pCurrPos = pCurrStart;
        while (pCurrPos < pCurrEnd && pCurrPos <= pCurrEndBlock)
        {
            if (*pCurrPos < 32)
                ets_printf(".");
            else
                ets_printf("%c", *pCurrPos);
            pCurrPos++;
        }
        ets_printf("\n");

        pCurrStart = pCurrEnd;
    }
}
#endif

// initialization of configuration manager
void ConfigurationManager_Initialize()
{
    memset((void *)&g_TargetConfiguration, 0, sizeof(HAL_TARGET_CONFIGURATION));

    ConfigStorage_Initialise();

    // enumerate the blocks
    ConfigurationManager_EnumerateConfigurationBlocks();
};

int32_t ConfigurationManager_FindConfigurationBlockSize(
    DeviceConfigurationOption configuration,
    uint32_t configurationIndex)
{
    FILE *handle;
    int32_t configSize = 0;

    handle = ConfigStorage_OpenFile(configuration, configurationIndex, false, false);
    if (handle != NULL)
    {
        configSize = ConfigStorage_FileSize(handle);
#ifdef DEBUG_CONFIG
        ets_printf("Find type %d index %d, length %d\n", (int)configuration, configurationIndex, configSize);
#endif
        ConfigStorage_CloseFile(handle);
    }

    return configSize;
}

bool StoreConfigBlock(
    DeviceConfigurationOption configType,
    uint32_t configurationIndex,
    void *configBlock,
    size_t writeSize)
{
    bool result = false;
    FILE *fileHandle;

    fileHandle = ConfigStorage_OpenFile(configType, configurationIndex, true, false);
    if (fileHandle != NULL)
    {
        result = ConfigStorage_WriteFile(fileHandle, (uint8_t *)configBlock, writeSize);
#ifdef DEBUG_CONFIG
        ets_printf(
            "store type %d index %d, length %d result %d\n",
            (int)configType,
            configurationIndex,
            writeSize,
            (int)result);
#endif
        ConfigStorage_CloseFile(fileHandle);
    }

    return result;
}

bool AppendConfigBlock(
    DeviceConfigurationOption configType,
    uint32_t configurationIndex,
    void *configBlock,
    size_t writeSize)
{
    bool result = false;
    FILE *fileHandle;

    fileHandle = ConfigStorage_OpenFile(configType, configurationIndex, true, true);

    if (fileHandle != NULL)
    {
        result = ConfigStorage_AppendFile(fileHandle, (uint8_t *)configBlock, writeSize);

#ifdef DEBUG_CONFIG
        ets_printf(
            "store type %d index %d, length %d result %d\n",
            (int)configType,
            configurationIndex,
            writeSize,
            (int)result);
#endif

        ConfigStorage_CloseFile(fileHandle);
    }

    return result;
}

// Enumerates the configuration blocks from the configuration flash sector
// it's implemented with 'weak' attribute so it can be replaced at target level if a different persistence mechanism is
// used
void ConfigurationManager_EnumerateConfigurationBlocks()
{
    HAL_CONFIGURATION_NETWORK *networkConfigs = ConfigStorage_FindNetworkConfigurationBlocks();

    // check network configs count
    if (networkConfigs->Count == 0)
    {
        // there is no network config block available, need to create a default for each network interface
        int networkCount = 0;
        NetworkInterfaceType netTypes[4] = {NetworkInterfaceType_Unknown};

        // ESP32 can have have up to 4 network interfaces: Wireless Station, Wireless AP, Ethernet and OpenThread

        // Allocate count & types of network interfaces
#if defined(CONFIG_SOC_WIFI_SUPPORTED)
        // Wireless Support
        netTypes[networkCount++] = NetworkInterfaceType_Wireless80211;
        netTypes[networkCount++] = NetworkInterfaceType_WirelessAP;
#endif

#ifdef ESP32_ETHERNET_SUPPORT
        netTypes[networkCount++] = NetworkInterfaceType_Ethernet;
        ethernetEnabled = true;
#endif

#if HAL_USE_THREAD == TRUE
        netTypes[networkCount++] = NetworkInterfaceType_Thread;
#endif
        // allocate memory for ONE network configuration
        HAL_Configuration_NetworkInterface *networkConfig =
            (HAL_Configuration_NetworkInterface *)platform_malloc(sizeof(HAL_Configuration_NetworkInterface));

        for (int configIndex = 0; configIndex < networkCount; configIndex++)
        {
            // clear memory
            memset(networkConfig, 0, sizeof(HAL_Configuration_NetworkInterface));

            networkConfig->InterfaceType = netTypes[configIndex];

            // init to default
            InitialiseNetworkDefaultConfig(networkConfig, configIndex);

            // store
            StoreConfigBlock(
                DeviceConfigurationOption_Network,
                configIndex,
                networkConfig,
                sizeof(HAL_Configuration_NetworkInterface));
        }

        // free memory
        platform_free(networkConfig);

        // have to enumerate again to pick it up
        networkConfigs = ConfigStorage_FindNetworkConfigurationBlocks();
    }

    // find wireless 80211 network configuration blocks
    HAL_CONFIGURATION_NETWORK_WIRELESS80211 *networkWirelessConfigs =
        (HAL_CONFIGURATION_NETWORK_WIRELESS80211 *)ConfigStorage_FindNetworkWireless80211ConfigurationBlocks();

