nanoframework/nf-interpreter/targets/ESP32/_common/targetHAL_ConfigurationManager.cpp
    // clear memory
    memset(configurationBlock, 0, sizeOfBlock);

    return ConfigurationManager_GetConfigurationBlockFromStorage(
        configuration,
        configurationIndex,
        (uint8_t *)configurationBlock,
        sizeOfBlock);
}

bool ConfigurationManager_StoreConfigurationBlockCertificate(
    DeviceConfigurationOption configuration,
    uint32_t configurationIndex,
    void *configurationBlock,
    uint32_t blockSize,
    uint32_t offset)
{
    if (offset == 0)
    {
        // if this is the 1st chunk of data for a certificate, delete the existing one, if that exists
        if (ConfigStorage_DeleteFile(configuration, configurationIndex))
        {
            if (configuration == DeviceConfigurationOption_X509CaRootBundle)
            {
                // need to free memory before enumerating again
                if (g_TargetConfiguration.CertificateStore->Count > 0)
                {
                    platform_free(g_TargetConfiguration.CertificateStore->Certificates[0]);
                }
                platform_free(g_TargetConfiguration.CertificateStore);

                g_TargetConfiguration.CertificateStore = ConfigStorage_FindX509CertificateConfigurationBlocks();
            }
            else if (configuration == DeviceConfigurationOption_X509DeviceCertificates)
            {
                // need to free memory before enumerating again
                if (g_TargetConfiguration.DeviceCertificates->Count > 0)
                {
                    platform_free(g_TargetConfiguration.DeviceCertificates->Certificates[0]);
                }
                platform_free(g_TargetConfiguration.DeviceCertificates);

                g_TargetConfiguration.DeviceCertificates =
                    ConfigStorage_FindX509DeviceCertificatesConfigurationBlocks();
            }
        }
    }

    return AppendConfigBlock(configuration, configurationIndex, configurationBlock, blockSize);
}

//
// Stores the configuration block to the storage
//
// Parameters:-
//   configurationBlock : Pointer to block to store
//   configuration      : Type of configuration block to store or All for block with multiple types
//   configurationIndex : Index of type to store ( not used for All )
//   blockSize          : Size of data pointed to by configurationBlock
//   offset             : Offset of data when multiple blocks (used for X502 CA Root and device certificate).
//                        For remaining types this should be zero.
//                        For ALL type blocks this is the offset in the total data of multiple types.
// Return:-
//    true - OK
//    false- Error/Not found
//
bool ConfigurationManager_StoreConfigurationBlock(
    void *configurationBlock,
    DeviceConfigurationOption configuration,
    uint32_t configurationIndex,
    uint32_t blockSize,
    uint32_t offset,
    bool done)
{
    bool result = false;
    bool requiresEnumeration = false;

#ifdef DEBUG_CONFIG
    ets_printf(
        "StoreConfig config:%d, index:%d  size:%d  offset:%d\n",
        (int)configuration,
        configurationIndex,
        blockSize,
        offset);
#endif

    if (configuration == DeviceConfigurationOption_All)
    {
        // not supported
        return false;
    }
    else
    {
        if (configuration == DeviceConfigurationOption_Network)
        {
            // set blockSize size
            blockSize = sizeof(HAL_Configuration_NetworkInterface);
        }
        else if (configuration == DeviceConfigurationOption_Wireless80211Network)
        {
            // set blockSize size
            blockSize = sizeof(HAL_Configuration_Wireless80211);
        }
        else if (configuration == DeviceConfigurationOption_WirelessNetworkAP)
        {
            // set blockSize size
            blockSize = sizeof(HAL_Configuration_WirelessAP);
        }
        else if (configuration == DeviceConfigurationOption_X509CaRootBundle)
        {
            // check for 0 size on certificate
            if (((HAL_Configuration_X509CaRootBundle *)configurationBlock)->CertificateSize)
            {
                result = ConfigurationManager_StoreConfigurationBlockCertificate(
                    configuration,
                    configurationIndex,
                    configurationBlock,
                    blockSize,
                    offset);

                // reset blockSize because storing has been handled
                blockSize = 0;

                // enumeration is required after we are DONE with SUCCESSFULLY storing all the config chunks
                requiresEnumeration = (result && done);
            }
            else
            {
                // 0 size means that there is a request to clear the certificate
                result = ConfigStorage_DeleteFile(configuration, configurationIndex);

                // check if operation was successful
                if (result)
                {
                    // reset this
                    blockSize = 0;

                    // enumeration is required
                    requiresEnumeration = true;
                }
            }

#ifdef DEBUG_CONFIG
            ets_printf(
                "StoreConfig x509 blockSize:%d, certsize:%d",
                blockSize,
                ((HAL_Configuration_X509CaRootBundle *)configurationBlock)->CertificateSize);
#endif
        }
        else if (configuration == DeviceConfigurationOption_X509DeviceCertificates)
        {
            // check for 0 size on certificate
            if (((HAL_Configuration_X509DeviceCertificate *)configurationBlock)->CertificateSize)
            {
                result = ConfigurationManager_StoreConfigurationBlockCertificate(
                    configuration,
                    configurationIndex,
                    configurationBlock,
                    blockSize,
                    offset);

                // reset blockSize because storing has been handled
                blockSize = 0;

                // enumeration is required after we are DONE with SUCCESSFULLY storing all the config chunks
                requiresEnumeration = (result && done);
            }
            else
            {
                // 0 size means that there is a request to clear the certificate
                result = ConfigStorage_DeleteFile(configuration, configurationIndex);

